<a href="https://colab.research.google.com/github/MRS88/AI_course/blob/master/%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D1%8F_04_Pandas_%D0%A7%D0%B0%D1%81%D1%82%D1%8C_2/Ultra_Light.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Задача 1

Загрузите таблицу city_temperature.csv в pandas DataFrame. При помощи встроенных методов библиотеки Pandas найдите количество стран, среднее значение температуры в которых бывает больше 100 градусов по Фаренгейту.

**Циклы и условия использовать нельзя**

Описание базы:
---------------------------------
**Region** - регион

**Country** - страна 

**State** - штат (если есть) 

**Month** - месяц 

**Day** - день 

**Year** - год 

**AvgTemperature** - средняя температура в Фаренгейтах

Ссылка на базу: https://drive.google.com/file/d/1bLiz_81Kb4pMryEalRe66jS38_F6vwMX/view?usp=sharing

**Решение:**

In [ ]:
import pandas as pd

data = pd.read_csv('/city_temperature.csv')
data[data['AvgTemperature'] > 100]

       Region        Country  State    City  Month  Day  Year  AvgTemperature
50515  Africa          Egypt    NaN   Cairo      5   23  2019           100.2
88434  Africa  Guinea-Bissau    NaN  Bissau      4   16  1998           100.1

### Задача 2

Найдите медиану столбца AvgTemperature при помощи встроенных методов библиотеки Pandas

**Решение:**

In [ ]:
data.AvgTemperature.median()

75.1

### Задача 3

Найдите число записей в базе данных для первого января 1995 года или первого января 2018 года при помощи масок.

**Решение:**

In [ ]:
data_1 = data[(data['Day'] == 1) & (data['Month'] == 1) & (data['Year'] == 1995)]
data_2 = data[(data['Day'] == 1) & (data['Month'] == 1) & (data['Year'] == 2018)]
print(data_1.size, data_2.size)

136 120

### Задание 4

**Решение:**

Получите список всех уникальных значений стран в таблице при помощи встроенных методов.

In [ ]:
data.Country.unique()

array(['Algeria', 'Burundi', 'Benin', 'Central African Republic', 'Congo',
       'Egypt', 'Ethiopia', 'Gabon', 'Gambia', 'Guinea', 'Guinea-Bissau',
       'Ivory Coast', 'Kenya', 'Morocco', 'Madagascar', 'Mauritania',
       'Malawi', 'Mozambique'], dtype=object)

### Задача 5
При помощи переводчика или при помощи своих знаний переведите названия столбцов на русский язык. Замените в таблице английские названия столбцов на русские

**Решение:**

In [ ]:
my_dict = {'Region': 'Регион',
           'Country': 'Страна',
           'State': 'Область',
           'City': 'Город',
           'Month': 'Месяц',
           'Day': 'День',
           'Year': 'Год',
           'AvgTemperature': 'Ср.температура'}

data.rename(columns=my_dict, inplace=True)
data

        Регион      Страна  Область    Город  Месяц  День   Год  Ср.температура
0       Africa     Algeria      NaN  Algiers      1     1  1995            64.2
1       Africa     Algeria      NaN  Algiers      1     2  1995            49.4
2       Africa     Algeria      NaN  Algiers      1     3  1995            48.8
3       Africa     Algeria      NaN  Algiers      1     4  1995            46.4
4       Africa     Algeria      NaN  Algiers      1     5  1995            47.9
...        ...         ...      ...      ...    ...   ...   ...             ...
153408  Africa  Mozambique      NaN   Maputo      8    26  2013            69.6
153409  Africa  Mozambique      NaN   Maputo      8    27  2013            73.8
153410  Africa  Mozambique      NaN   Maputo      8    28  2013            79.5
153411  Africa  Mozambique      NaN   Maputo      8    29  2013            77.5
153412  Africa  Mozambique      NaN   Maputo      8    30    20             NaN

[153413 rows x 8 columns]